[LANG]
language=Portuguese (Portugal)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Erro de sintaxe SQL
200002=Arquivo não encontrado
200003=Arquivo corrompido
200004=Erro de parâmetro
200026=Nome da tabela já duplicado
200027=Nome da tabela não existe
200028=Erro ao importar arquivo CSV, não foi possível gerar SQL. Verifique se o conteúdo do arquivo CSV e os itens de configuração estão corretos
300001=Nenhuma coluna de tabela selecionada para criar índice
300002=A instrução SQL não pode estar vazia
300003=A análise SQL suporta apenas instruções de consulta SELECT
[STRING]
home=Início
database=Banco de dados
analysis=Análise
view=Visão
setting=Configurações
items=registros
tables=Tabelas
views=Visões
triggers=Gatilhos
columns=Colunas
indexes=Índices
table=Tabela
clear-all=Limpar tudo
yes=Sim
no=Não
welcome-text=Bem-vindo ao CuteSqlite
home-text1=CuteSqlite é uma ferramenta de cliente de interface gráfica de usuário (GUI) para Sqlite3.
home-text2=Ele permite que você projete, crie e navegue em bancos de dados, manipule objetos de banco de dados,
home-text3=e insira dados, além de projetar e executar consultas SQL para processar dados armazenados.
home-text4=Você também pode migrar bancos de dados e dados de outros fornecedores de banco de dados para o banco de dados Sqlite.
db-section-text=Banco de dados Sqlite
analysis-text1=CuteSqlite permite que você analise e otimize o desempenho das instruções SQL.
analysis-text2=E permite que você analise a capacidade de armazenamento de cada tabela no banco de dados,
analysis-text3=bem como configure os parâmetros do banco de dados para otimizar o banco de dados.
perf-analysis-section-text=Análise de desempenho
error-text=Erro do sistema:
create-database=Criar novo banco de dados (Ctrl+N)
open-database=Abrir banco de dados (Ctrl+O)
refresh-database=Atualizar banco de dados (F5)
delete-database=Remover banco de dados selecionado da lista (Del)
override-user-db=Os dados do arquivo não podem ser recuperados após a exclusão. Tem certeza de que deseja sobrescrever o banco de dados?
create-db-success-text=Banco de dados criado com sucesso
open-db-exists-inlist=Banco de dados já aberto, não repita a operação
open-db-success-text=Banco de dados aberto com sucesso
delete-user-db=Tem certeza de que deseja remover o banco de dados "{dbName}" selecionado da lista?
delete-db-success-text=Remoção do banco de dados da lista bem-sucedida
query-editor=Editor de consultas
history=Histórico
history-tip=Histórico (F8)
result-list=Resultado
result-info=Informações
result-table-data=Dados da tabela
table-properties=Propriedades da tabela
exec-select-sql=Executar consulta selecionada atual (F9)
exec-all-sql=Executar todas as consultas (F10)
explain-select-sql=Explain da instrução SQL selecionada atual (F11)
explain-query-plan-sql=Explain query plan da instrução SQL selecionada atual (F12)
query-page-help=Função de preenchimento automático: [Tab]->Próxima aba; [Ctrl+Space]->Listar abas correspondentes; [Ctrl+Enter]->Listar todas as abas
no-select-userdb=Nenhum banco de dados selecionado
no-sql-statement=Nenhuma instrução SQL inserida no editor de consultas
no-sql-content=Nenhuma instrução SQL no editor de consultas
show-form-view=Mostrar visão de formulário
export-result-as=Exportar como... (Ctrl+Alt+E)
copy-result-data=Copiar dados para a área de transferência
clear-all=Limpar tudo
ok=OK
cancel=Cancelar
export-text-description=Selecione o formato de exportação de dados
csv-settings=Opções csv
csv-field-settings=Colunas
csv-line-settings=Linhas
csv-charset-settings=Codificação
excel-settings=Opções Excel
sql-settings=Opções SQL
export-fields-settings=Selecione as colunas a exportar
terminated-by=Delimitador
enclosed-by=Delimitador de campo
escaped-by=Caractere de escape
field-terminated-by=Delimitador de coluna
field-enclosed-by=Delimitador de coluna
field-escaped-by=Caractere de escape de coluna
line-terminated-by=Quebra de linha
add-column-name=Adicionar nome da coluna no cabeçalho
csv-charset=Codificação
excel-column-max-size=Limite de tamanho da coluna de texto
excel-decinmal-places=Casas decimais
structure-only=Apenas estrutura da tabela
data-only=Apenas dados
structure-and-data=Estrutura da tabela e dados
select-all=Selecionar tudo
deselect-all=Desmarcar tudo
save-to-file=Exportar para arquivo
expert-fmt-error=Por favor, selecione o formato de arquivo para exportação de dados
terminated-by-error=Por favor, insira o valor "Terminado por"
enclosed-by-error=Por favor, insira o valor "Delimitado por"
escaped-by-error=Por favor, insira o valor "Caractere de escape"
line-terminated-by-error=O valor "Terminado por" da linha está incorreto
excel-column-max-size-error=Por favor, insira o valor "Limite de tamanho da coluna de texto"
excel-decinmal-places-error=Por favor, insira o valor "Casas decimais"
export-sql-error=Por favor, selecione as opções SQL
selected-fields-error=Por favor, selecione as colunas a exportar
export-path-error=Por favor, insira o caminho do arquivo de exportação
sql-notsupport-multitable-query-error=A exportação de resultados de consultas multi-tabela e subconsultas não é suportada
export-success-text=Exportação bem-sucedida, {rows} linhas de dados exportadas. Deseja abrir o arquivo?
open-the-file=Abrir arquivo
export-file-exists-prompt={export-path} já existe. Deseja substituir?
limit-rows=Limite de linhas
offset=Linha inicial
rows=Número de linhas
copy-all-rows-to-clipboard=Copiar todas as linhas para a área de transferência	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Copiar linhas selecionadas para a área de transferência	Ctrl+Alt+H
copy-all-rows-as-sql=Copiar todas as linhas como SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Copiar linhas selecionadas como SQL	Ctrl+Alt+K
read-only=Somente leitura
filter=Filtro (Ctrl+Alt+F)
filter-in-use=Filtro em uso
refresh=Atualizar (Ctrl+F5)
refresh-page=Atualizar
new-row-tip=Criar nova linha (Ctrl+Alt+N)
copy-row-tip=Copiar uma linha (Ctrl+Alt+C)
save-tip=Salvar (Ctrl+Alt+S)
delete-tip=Excluir linhas selecionadas (Ctrl+Del)
cancel-tip=Desfazer alterações (Ctrl+Alt+Z)
revert-tip=Restaurar
save=Salvar
revert=Desfazer alterações
column=Nome da coluna
condition=Condição
value=Valor
delete-confirm-text=Tem certeza de que deseja excluir as linhas selecionadas?
query=Consulta
result=Resultado
affected-rows=Linhas afetadas
exec-time=Tempo de execução
transfer-time=Tempo de transferência
total-time=Tempo total
database-create=Criar novo banco de dados		Ctrl+N
database-open=Abrir banco de dados		Ctrl+O
database-refresh=Atualizar banco de dados		Ctrl+R
database-delete=Excluir banco de dados		Del
database-copy=Copiar banco de dados como...	Ctrl+P
database-export-as-sql=Exportar banco de dados para SQL	Ctrl+E
database-import-from-sql=Importar SQL para banco de dados	Ctrl+I
database-new=Criar
database-new-table=Tabela
database-new-view=Visão
database-new-trigger=Gatilho
export-as-sql-text-description=Exportar tabelas/visões/gatilhos do banco de dados selecionado como SQL
select-database=Banco de dados selecionado
database-objects=Objetos
structure-and-data-settings=Configurações de estrutura e dados
insert-statement-settings=Configurações de instrução INSERT
tbl-statement-settings=Configurações de instrução de tabela
retain-column-text=Manter nomes de colunas em "Insert Into"
contain-multi-rows-text=Cada instrução "Insert" contém múltiplas linhas (VALUES)
retain-table-text=Manter tabela antiga (Create Table If Not Exists ...)
override-table-text=Sobrescrever tabela antiga (DROP TABLE, depois CREATE TABLE)
import-from-sql-text-description=Executar em lote as instruções no arquivo SQL.
abort-on-error-text=Interromper em caso de erro.
import-file-not-exists=O arquivo SQL a importar não existe. Por favor, selecione novamente.
import-path-empty-error=O caminho do arquivo a importar não pode estar vazio.
import=Importar
export=Exportar
tbl-name=Nome da tabela
new-table=Criar tabela
new-view=Criar visão
new-trigger=Criar gatilho
database=Banco de dados
schema=Esquema
table-columns=Colunas
table-indexes=Índices
table-foreignkeys=Chaves estrangeiras
column-name=Nome da coluna
data-type=Tipo de dado
default=Padrão
check=Verificar
index-name=Nome do índice
index-type=Tipo de índice
index-unique=Único
partial-clause=Cláusula parcial
comments=Comentários
to-be-selected=Colunas aguardando seleção
selected=Colunas selecionadas
up=▲
down=▼
no-columns-selected=Nenhuma coluna selecionada. Por favor, selecione.
sql-preview=Pré-visualização SQL
tbl-name-empty=O nome da tabela não pode estar vazio
tbl-name-duplicated=O nome da tabela já está duplicado
create-table-success-text=Tabela criada com sucesso.
alter-table-success-text=Tabela modificada com sucesso.
rename-table-success-text=Nome da tabela modificado com sucesso.
delete-column-confirm-text=A coluna selecionada é referenciada por um ou mais índices. Excluir esta coluna também modificará os índices correspondentes. Continuar com a exclusão?
delete-index-confirm-text=O índice selecionado é referenciado por uma ou mais colunas. Excluir este índice também modificará as colunas correspondentes. Continuar com a exclusão?
delete-confirm-text=Continuar com a exclusão?
new-view=Criar visão
new-trigger=Criar gatilho
create-a-view-name=Nome da nova visão
view-name-not-empty=O nome da nova visão não pode estar vazio
view-name-duplicated=O nome da visão já está duplicado
create-a-trigger-name=Nome do gatilho
trigger-name-not-empty=O nome do gatilho não pode estar vazio
trigger-name-duplicated=O nome do gatilho já está duplicado
execute-sql-success=Execução SQL bem-sucedida
copy-db-success-text=Cópia do banco de dados bem-sucedida
table-open=Abrir dados da tabela		Alt+O
table-create=Criar tabela		Alt+N
table-alter=Modificar tabela		Alt+A
table-rename=Renomear tabela		Alt+M
table-truncate=Esvaziar tabela		Alt+T
table-drop=Excluir tabela		Alt+Del
table-copy-as=Copiar tabela como...		Alt+P
table-sharding-as=Fragmentação		Alt+G
table-export=Exportar tabela como...	Alt+E
table-import-sql=Importar de arquivo SQL	Alt+I
table-import-csv=Importar de arquivo CSV	Alt+J
table-manage-index=Gerenciar índices da tabela
table-manage-foreign-key=Gerenciar chaves estrangeiras da tabela
properties=Propriedades
primary-key-duplicated=Chave primária (Primary key) definida duplicadamente.
foreignkey-name=Nome da chave estrangeira
referencing-columns=Colunas desta tabela
referenced-table=Tabela referenciada
referenced-columns=Colunas referenciadas
on-update=On Update
on-delete=On Delete
insert-new-column=Adicionar nova coluna
insert-new-index=Adicionar novo índice
insert-new-foreignkey=Adicionar nova chave estrangeira
insert-del-column=Excluir coluna selecionada
insert-del-index=Excluir índice selecionado
insert-del-foreignkey=Excluir chave estrangeira selecionada
select-referenced-table-first=Por favor, selecione a tabela referenciada primeiro
new-table-name=Novo nome da tabela
table-name-not-empty=O novo nome da tabela não pode estar vazio
table-name-duplicated=O novo nome da tabela já está duplicado
ai-column-exists=A coluna de autoincremento (AUTOINCREMENT) já existe.
ai-fobidden-multi-pk=Já existe uma coluna de autoincremento (AUTOINCREMENT). Múltiplas colunas de chave primária não são permitidas.
ai-column-must-integer=A coluna de autoincremento (AUTOINCREMENT) deve ser do tipo INTEGER.
truncate-table-confirm-text=Após esvaziar a tabela, os dados não podem ser recuperados. Tem certeza de que deseja esvaziar?
truncate-table-success-text=Esvaziamento da tabela de dados bem-sucedido
drop-table-confirm-text=Após excluir a tabela de dados, os dados não podem ser recuperados. Tem certeza de que deseja excluir?
drop-table-success-text=Exclusão da tabela de dados bem-sucedida
copy-table-text-description=Configurar parâmetros de cópia, suporta fragmentação de tabelas de dados
from-db-name=Banco de dados de origem
from-tbl-name=Tabela de origem
to-db-name=Banco de dados de destino
to-tbl-name=Tabela de destino
table-sharding-setttings=Fragmentação de tabela de dados
enable-table-sharding=Habilitar fragmentação de tabela de dados
table-suffix-begin={suffix} Número inicial
table-suffix-end={suffix} Número final
advanced-settings=Opções avançadas de fragmentação de tabela
enable-copy-data-with-strategy=Habilitar estratégia, copiar dados para tabelas de fragmentação
sharding-strategy-express-text=Expressão da estratégia de divisão de tabela: {n}
preview-sql=Pré-visualização da instrução SQL
structure-and-data-settings-unknown=Configurações de estrutura e dados não selecionadas
table-suffix-error=Número de fragmentação inválido. Por favor, insira um valor correto.
target-table-name-no-n=A tabela de destino deve conter a string "{n}".
sharding-strategy-express-empty=A expressão da estratégia de divisão de tabela não pode estar vazia
copy-table-success-text=Cópia da tabela bem-sucedida.
start=Iniciar
complete=Concluir
express-title=Expressão da estratégia de fragmentação de tabela
functions=Funções
express-editor-help=Expressão - Clique duplo na função ou coluna, inserir no editor
import-from-csv-text-description=Itens de configuração para importação de dados de arquivo CSV
source-csv-file=Caminho do arquivo CSV de origem
target-database=Banco de dados de destino
target-table=Tabela de destino
columns-setttings=Colunas
csv-data=Dados CSV
column-name-on-top=Primeira linha como nome da coluna
line-terminated-by=Quebra de linha
csv-null-as-keyword=null/NULL como palavra-chave SQL
encoding=Codificação
import-success-text=Importação bem-sucedida
incorrect-sql-statement=Instrução SQL incorreta
import-error-text=Erro de importação
table-manage-columns=Gerenciar colunas
table-drop-column=Excluir coluna
table-manage-indexes=Gerenciar índices
table-drop-index=Excluir índice
create-view=Criar nova visão
open-view=Abrir visão
drop-view=Excluir visão
create-trigger=Criar gatilho
open-trigger=Abrir gatilho
drop-trigger=Excluir gatilho
drop-view-confirm-text=Após excluir a visão, a visão não pode ser recuperada. Tem certeza de que deseja excluir?
drop-view-success-text=Exclusão da visão bem-sucedida
drop-trigger-confirm-text=Após excluir o gatilho, o gatilho não pode ser recuperado. Tem certeza de que deseja excluir?
drop-trigger-success-text=Exclusão do gatilho bem-sucedida
sql-templates=Modelos de instrução SQL
pragma-templates=Pragmas
sql-log=Log SQL
clear-all=Limpar tudo
use=Usar
explain=Explain
top=Para cima
untop=Remover do topo
copy=Copiar
delete=Excluir
today=Hoje
yestoday=Ontem
delete-sql-log-confirm-text=Tem certeza de que deseja excluir o log SQL?
copy-to-clipboard=Copiado para a área de transferência
save-success-text=Salvo com sucesso
delete-success-text=Excluído com sucesso
data-has-changed=Os dados foram alterados. Tem certeza de que deseja fechar a página?
not-save-and-close=Não salvar, fechar
cancel=Cancelar fechamento
table-export-as=Exportar tabela de dados	Alt+E
export-as-sql-success-text=Exportação bem-sucedida. Deseja abrir o arquivo?
new-query=Criar nova janela de consulta (F7)
save-current=Salvar atual (Ctrl+S)
save-all=Salvar tudo (Ctrl+Shift+S)
first-page=Primeira página
prev-page=Página anterior
next-page=Próxima página
last-page=Última página
save-if-data-has-changed=Os dados foram alterados. Deseja salvar primeiro?
unsort=Cancelar ordenação
tab-close-this=Fechar
tab-close-others=Fechar outros
tab-close-left=Fechar todos à esquerda
tab-close-right=Fechar todos à direita
perf-analysis=Análise de desempenho
perf-analysis-reports=Relatórios de análise
store-analysis=Análise de armazenamento
db-params=Parâmetros do banco de dados
not-select-sql=Apenas instruções SELECT suportadas
open-sql-log=Abrir log SQL para análise de desempenho (Ctrl+L)
add-sql-analysis=Inserir instrução SQL para análise de desempenho (Ctrl+I)
sql-log-not-found=Log SQL não encontrado. Por favor, verifique se foi excluído.
original-sql=Instrução SQL original
where-clause-analysis=Análise da cláusula WHERE
order-clause-analysis=Análise da cláusula ORDER
covering-index-analysis=Análise de índice de cobertura
table-join-analysis=Análise de Joins
in-table=Tabela de dados
where-use-column=A instrução WHERE usa a coluna
order-use-column=A instrução ORDER usa a coluna
covering-index-column=As instruções WHERE e ORDER usam a coluna
where-use-index=A instrução WHERE usa o índice
order-use-index=A instrução ORDER usa o índice
use-covering-index=Índice de cobertura usado
create-index-for-performance=Sugestão: Criar um índice para as seguintes colunas pode melhorar o desempenho da consulta.
hint-index-for-performance=Sugestão: O índice{hintIndexName} cobre as colunas incluídas: {hintIndexColumns}
create-covering-index-for-performance=Sugestão: Criar um índice de cobertura para as seguintes colunas pode melhorar o desempenho da consulta.
create-index-togeger=Criar índice
create-index-individ=Criar índice individualmente
create-covering-index=Criar índice de cobertura
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=O pseudocódigo abaixo mostra o processo de execução do otimizador de consultas.
cycle-count=Estatísticas de loop
optimize-cycle-count=Sugestão: Alterar a ordem das tabelas JOIN diferentes pode otimizar e reduzir o número de loops.
general-settings=Configurações gerais
about=Sobre
language-setting=Configurações de idioma da interface
change-language-restart-text=Para alterar o idioma, é necessário reiniciar este software.
close-and-restart=Fechar e reiniciar
do-not-restart=Não reiniciar
about-us=Sobre nós
about-us-description=CuteSqlite é um software de código aberto desenvolvido pelo autor Xuehan Qin.
version-info=Versão
version-info-description=CuteSqlite v0.2.2 beta (64 bits)
feedback=Feedback
feedback-description=Se você tiver problemas de software, ou ideias e sugestões para este aplicativo, por favor, preencha o formulário abaixo para nos enviar feedback.
content-text=Conteúdo
license=Apache License Version 2.0
select-columns-analysis=Análise de colunas Select
select-use-column=A instrução Select usa as seguintes colunas
select-use-column-count=Número de colunas
select-use-column-advice=Sugestão: As colunas selecionadas na instrução SELECT excedem{maxColumns} colunas. Reduzir as colunas pode melhorar o desempenho da consulta.
select-use-column-tips=Sugestão: Reduzir as colunas pode melhorar o desempenho da consulta.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=Análise de armazenamento:
analysis-sql=Análise SQL
open-perf-report=Abrir relatório		Alt+O
drop-perf-report=Excluir relatório		Alt+Del
drop-perf-report-confirm-text=Tem certeza de que deseja excluir o relatório?
store-analysis-text=Permite que você analise a capacidade de armazenamento do banco de dados, tabelas de dados, índices de tabela
table-store-analysis=Tabela - {tblName}
index-store-analysis=Índice - {idxName} - Tabela pertencente:{tblName}
db-disk-used-title=Relatório de utilização de espaço em disco, Caminho DB:{dbPath}
page-size-text=Tamanho da página (Unidade: Bytes)
page-size-tips=Tamanho da página (Unidade: Bytes)
file-bytes-text=Tamanho do arquivo (Unidade: Bytes)
file-bytes-tips=Tamanho do arquivo (Unidade: Bytes)
file-pgcnt-text=Número de páginas em todo o arquivo (Valor medido)
file-pgcnt-tips=Número de páginas em todo o arquivo (Valor medido)
file-pgcnt2-text=Número de páginas em todo o arquivo (Valor calculado)
file-pgcnt2-tips=Número de páginas em todo o arquivo (Valor calculado)
inuse-pgcnt-text=Número de páginas de armazenamento de dados (Usadas)
inuse-pgcnt-tips=Número de páginas de armazenamento de dados (Usadas)
free-pgcnt2-text=Número de páginas não de armazenamento de dados (Cada cabeçalho)
free-pgcnt2-tips=Número de páginas não de armazenamento de dados (Cada cabeçalho)
free-pgcnt-text=Número de páginas não de armazenamento de dados (Valor calculado)
free-pgcnt-tips=Número de páginas não de armazenamento de dados (Valor calculado)
av-pgcnt-text=Número de páginas excluídas automaticamente
av-pgcnt-tips=Número de páginas excluídas automaticamente
ntable-text=Número de tabelas no banco de dados
ntable-tips=Número de tabelas no banco de dados
nindex-text=Número de índices
nindex-tips=Número de índices
nmanindex-text=Número de índices definidos
nmanindex-tips=Número de índices definidos
nautoindex-text=Número de índices implícitos (Índices de autoincremento)
nautoindex-tips=Número de índices implícitos (Índices de autoincremento)
user-payload-text=Número de bytes de armazenamento da carga útil efetiva do usuário
user-payload-tips=Número de bytes de armazenamento da carga útil efetiva do usuário
all-tbl-entrycnt-title=Quantidade de dados de todas as tabelas (Número)
all-tbl-idx-pagecnt-title=Número de páginas de todas as tabelas e seus índices
sperate-tbl-idx-pagecnt-title=Número de páginas de todas as tabelas e índices calculado separadamente
all-tbl-idx-report-title=Todas as tabelas e índices
total-pages-percent-text=Porcentagem do total do banco de dados
total-pages-percent-tips=Porcentagem do total do banco de dados
nentry-text=Quantidade de dados (Número)
nentry-tips=Quantidade de dados (Número)
storage-text=Número de bytes de armazenamento consumidos
storage-tips=Número de bytes de armazenamento consumidos
compressed-size-text=Número de bytes usados após a compressão
compressed-size-tips=Número de bytes usados após a compressão
payload-text=Número de bytes da carga útil
payload-tips=Número de bytes da carga útil
total-meta-text=Número de bytes dos metadados
total-meta-tips=Número de bytes dos metadados
depth-text=Profundidade da B-tree
depth-tips=Profundidade da B-tree
avg-payload-text=Carga útil efetiva média por dado
avg-payload-tips=Carga útil efetiva média por dado
avg-unused-text=Número de bytes não usados médios por dado
avg-unused-tips=Número de bytes não usados médios por dado
avg-meta-text=Metadados médios por dado
avg-meta-tips=Metadados médios por dado
avg-fanout-text=Número médio de fanout
avg-fanout-tips=Número médio de fanout
gap-cnt-text=Páginas não contíguas
gap-cnt-tips=Páginas não contíguas
mx-payload-text=Carga útil efetiva máxima por dado
mx-payload-tips=Carga útil efetiva máxima por dado
ovfl-cnt-text=Número de dados de overflow usados
ovfl-cnt-tips=Número de dados de overflow usados
int-pages-text=Número de páginas de índice usadas
int-pages-tips=Número de páginas de índice usadas
leaf-pages-text=Número de páginas folha usadas
leaf-pages-tips=Número de páginas folha usadas
ovfl-pages-text=Número de páginas de overflow usadas
ovfl-pages-tips=Número de páginas de overflow usadas
total-pages-text=Número total de páginas usadas
total-pages-tips=Número total de páginas usadas
int-unused-text=Bytes não usados nas páginas de índice
int-unused-tips=Bytes não usados nas páginas de índice
leaf-unused-text=Bytes não usados nas páginas folha
leaf-unused-tips=Bytes não usados nas páginas folha
ovfl-unused-text=Bytes não usados nas páginas de overflow
ovfl-unused-tips=Bytes não usados nas páginas de overflow
total-unused-text=Bytes não usados em todas as páginas
total-unused-tips=Bytes não usados em todas as páginas
all-table-report-title=Todas as tabelas (Excluindo índices)
all-indices-report-title=Todos os índices (Excluindo tabelas)
tbl-and-all-idx-report-title=Tabela {tblName} e todos os seus índices
tbl-only-report-title=Tabela {tblName} excluindo quaisquer índices
idx-only-report-title=Todos os índices da tabela {tblName}
tbl-report-title=Tabela {tblName}
idx-report-title=Índice {idxName} da tabela {tblName}
props-tbl-only-report-title=Análise de armazenamento da tabela {tblName}
props-idx-props-only-report-title=Todos os índices da tabela {tblName}
db-pragma-params=Parâmetros PRAGMA
db-quick-config-params=Esquema de configuração rápida
select-pragma=PRAGMA
pragma-analysis-limit-tips=Consulta ou altera o limite das configurações de análise aproximada (ANALYZE). Este é o número aproximado de linhas verificadas pelo comando de análise (ANALYZE) em cada índice.
pragma-application-id-tips=Usado para consultar ou definir o inteiro "Applicatioin ID" de 32 bits com sinal big-endian no offset 68 no cabeçalho do banco de dados.
pragma-auto-vacuum-tips=Consulta ou define o status de vacuum automático no banco de dados.
pragma-automatic-index-tips=Consulta, define ou limpa a função de índice automático.
pragma-busy-timeout-tips=Consulta ou altera a configuração de timeout ocupado (busy timeout).
pragma-cache-size-tips=Consulta ou altera o número máximo de páginas de disco do banco de dados recomendadas pelo SQLite para manter na memória para cada arquivo de banco de dados aberto.
pragma-cache-spill-tips=Habilita ou desabilita a função do pager de despejar páginas de cache sujas no arquivo do banco de dados durante uma transação.
pragma-case-sensitive-like-tips=O comportamento padrão do operador LIKE é ignorar maiúsculas/minúsculas de caracteres ASCII. Portanto, por padrão, 'a' LIKE 'A' é verdadeiro.
pragma-cell-size-check-tips=Habilita ou desabilita outras verificações de integridade ao ler a página B-tree do banco de dados do disco pela primeira vez. Após habilitar a verificação de tamanho de célula, o dano do banco de dados pode ser detectado mais cedo e é menos provável que se "espalhe (Spread)".
pragma-checkpoint-fullfsync-tips=Consulta ou altera a flag fullfsync da operação de checkpoint. Se esta flag estiver definida, o método de sincronização F_FULLFSYNC será usado durante a execução da operação de checkpoint em sistemas que suportam F_FULLFSYNC. O valor padrão da flag CHECKPOINT_FULLFSYNC é OFF. Apenas Mac OS-X suporta F_FULLFSYNC.
pragma-collation-list-tips=Retorna a lista de sequências de ordenação definidas para a conexão de banco de dados atual.
pragma-compile-options-tips=Retorna os nomes das opções de tempo de compilação usadas durante a compilação do SQLite, uma opção por linha.
pragma-count-changes-tips=Consulta ou altera a flag count-changes. Normalmente, quando a flag count-changes não está definida, as instruções INSERT, UPDATE e DELETE não retornam dados.
pragma-data-store-directory-tips=Consulta ou altera o valor da variável global sqlite3_data_directory. O backend da interface do sistema operacional Windows usa esta variável para determinar o local de armazenamento do arquivo de banco de dados especificado com o nome do caminho relativo.
pragma-data-version-tips=Indica que o arquivo do banco de dados foi modificado. Programas interativos que armazenam conteúdo do banco de dados na memória ou exibem conteúdo do banco de dados na tela podem usar o comando PRADMA data_version para determinar se precisam atualizar e recarregar a memória ou atualizar a exibição na tela.
pragma-default-cache-size-tips=Consulta ou define o número máximo de páginas de cache de disco recomendadas para alocar para cada arquivo de banco de dados aberto.
pragma-defer-foreign-keys-tips=Indica que todas as restrições de chave estrangeira são adiadas até o commit da transação mais externa.
pragma-empty-result-callbacks-tips=Consulta ou altera a flag de callback de resultado vazio.
pragma-encoding-tips=Codificação de texto usada pelo banco de dados principal, uma entre 'UTF-8', 'UTF-16le'(Codificação UTF-16 little-endian) ou'UTF-16be'(Codificação UTF-16 big-endian).
pragma-foreign-key-check-tips=Verifica se o banco de dados ou tabela tem violações de restrições de chave estrangeira
pragma-foreign-keys-tips=Consulta, define ou limpa a aplicação de restrições de chave estrangeira.
pragma-freelist-count-tips=Retorna o número de páginas não utilizadas no arquivo do banco de dados.
pragma-full-column-names-tips=Consulta ou altera a flag full_column_names.
pragma-fullfsync-tips=Consulta ou altera a flag fullfsync. Esta flag determina se esse método é usado em sistemas que suportam o método de sincronização F_FULLFSYNC. O valor padrão da flag Fullfsync é OFF. Apenas Mac OS X suporta F_FULLFSYNC.
pragma-hard-heap-limit-tips=Impõe um limite na quantidade de memória heap para todas as conexões de banco de dados em um único processo.
pragma-ignore-check-constraints-tips=Habilita ou desabilita a aplicação de restrições de verificação. A configuração padrão é OFF, o que significa que as restrições de verificação são aplicadas por padrão.
pragma-incremental-vacuum-tips=Faz com que no máximo N páginas sejam removidas da lista livre.
pragma-integrity-check-tips=Executa verificações de formatação e consistência de baixo nível no banco de dados.
pragma-journal-mode-tips=Consulta ou define o modo de journal do banco de dados associado à conexão de banco de dados atual.
pragma-journal-size-limit-tips=Limita o tamanho do log de rollback e dos arquivos WAL restantes no sistema de arquivos após uma transação ou checkpoint.
pragma-legacy-alter-table-tips=Define ou consulta o valor da flag legacy_alter_table.
pragma-locking-mode-tips=Define ou consulta o modo de bloqueio da conexão de banco de dados. O modo de bloqueio é modo normal (NORMAL) ou modo exclusivo (EXCLUSIVE).
pragma-max-page-count-tips=Consulta ou define o número máximo de páginas no arquivo do banco de dados.
pragma-mmap-size-tips=Consulta ou altera o número máximo de bytes reservados para I/O mapeado em memória (memory-mapped I/O) em um único banco de dados.
pragma-module-list-tips=Retorna a lista de módulos de tabela virtual registrados com a conexão de banco de dados.
pragma-optimize-tips=Tenta otimizar o banco de dados.
pragma-page-count-tips=Retorna o número total de páginas no arquivo do banco de dados.
pragma-page-size-tips=Consulta ou define o tamanho da página do banco de dados. O tamanho da página deve ser uma potência de 2 entre 512 e 65536.
pragma-parser-trace-tips=Ativa o rastreamento do parser SQL usado internamente pelo SQLite. Tem efeito quando compilado com SQLITE_DEBUG.
pragma-query-only-tips=Previne alterações de dados no arquivo do banco de dados. Quando isso está habilitado, qualquer tentativa de CREATE, REPORT, DROP, REPORT ou UPDATE levará a um erro SQLITE_READONLY.
pragma-quick-check-tips=Executa configurações de formatação e verificações de consistência de baixo nível no banco de dados, pulando as verificações de consistência UNIQUE e de índice.
pragma-read-uncommitted-tips=Consulta, define ou limpa o isolamento READ UNCOMMITTED.
pragma-recursive-triggers-tips=Consulta, define ou limpa a função recursiva de gatilhos.
pragma-reverse-unordered-selects-tips=Quando habilitado, este PRAGMA faz com que muitas instruções SELECT sem cláusula ORDER BY emitam resultados na ordem inversa do usual.
pragma-schema-version-tips=Obtém ou define o valor inteiro chema-versio no offset 40 no cabeçalho do banco de dados.
pragma-secure-delete-tips=Consulta ou altera a configuração de exclusão segura (secure-delete).
pragma-short-column-names-tips=Consulta ou altera a flag de nome de coluna curta.
pragma-soft-heap-limit-tips=Limita a quantidade de memória heap ocupada para todas as conexões de banco de dados em um único processo.
pragma-stats-tips=Retorna informações auxiliares sobre tabelas e índices.
pragma-synchronous-tips=Consulta ou altera a configuração da flag "síncrono (synchronous)".
pragma-temp-store-tips=Consulta ou altera o valor da variável global sqlite3_temp_directory. Muitos backends de interface de sistema operacional usam esta variável para determinar onde armazenar tabelas e índices temporários.
pragma-threads-tips=Número de threads auxiliares iniciados pela instrução preparada (prepared statement) para ajudar a consulta.
pragma-trusted-schema-tips=Permitir a execução de funções SQL e tabelas virtuais não auditadas de segurança no esquema. Determina se permite que visões, gatilhos ou expressões de esquema (como restrições CHECK, cláusulas DEFAULT, colunas geradas, índices de expressão e/ou índices parciais) executem funções SQL e tabelas virtuais não auditadas de segurança.
pragma-user-version-tips=Obtém ou define o valor inteiro user-version no offset 60 no cabeçalho do banco de dados
pragma-vdbe-addoptrace-tips=O opcode VDBE completo é exibido quando criado durante a geração de código. Pré-requisito é SQLite compilado com a opção SQLITE_DEBUG e vdbe_debug habilitado.
pragma-vdbe-debug-tips=Habilita a depuração VDBE, pré-requisito é SQLite compilado com a opção SQLITE_DEBUG
pragma-vdbe-listing-tips=Exibe a lista completa de opcodes da máquina virtual na saída padrão. Pré-requisito é SQLite compilado com a opção SQLITE_DEBUG e vdbe_debug habilitado.
pragma-vdbe-trace-tips=Imprime o opcode da máquina virtual na saída padrão durante o cálculo. Pré-requisito é SQLite compilado com a opção SQLITE_DEBUG e vdbe_debug habilitado.
pragma-wal-autocheckpoint-tips=Consulta ou define o intervalo do write-ahead log/auto-checkpoint.
pragma-wal-checkpoint-tips=Faz com que o conteúdo no write-ahead log do banco de dados X na conexão de banco de dados D seja transferido para o arquivo do banco de dados e reseta o write-ahead log.
pragma-writable-schema-tips=A tabela sqlite_schema pode ser modificada usando as instruções UPDATE, INSERT e DELETE normais. Aviso: O abuso desta diretiva de compilação pode facilmente levar ao dano do arquivo do banco de dados.
pragma-save-confirm=A instrução PRAGMA afetará a operação do banco de dados. Tem certeza de que deseja executar as instruções abaixo?
confirm-exec-text=Confirmar e Executar